_posts/2013-08-09-migrating-away-from-google-blogger.html
---
title: "Migrating away from Google Blogger"
date: 2013-08-09
layout: post
categories: emacs
published: true
comments:
---
<p>
This blog is moving away from Google Blogger. Update your RSS reader.
</p>

<p>
Moving to a self-hosted platform will allow me to:
</p>

<ul class="org-ul">
<li>have a better control of my data. My blog can now be versioned on GitHub and do not depend of Google anymore.
</li>
<li>have a better workflow. I can now blog in plain text with Emacs, <a href="http://octopress.org">Octopress</a> and <a href="https://github.com/yoshinari-nomura/org-octopress">org-octopress</a>.
</li>
</ul>

<p>
Of course the reliability may not be as good as the Google
services but in general I think I will enjoy the journey!
</p>
